app/Models/ModelPemilik.php

SELECT *
FROM `tb_pemilik`
ORDER BY `nama` ASC
---
    public function allData()
    {
        return $this->db->table('tb_pemilik')
            ->orderBy('nama', 'ASC')
            ->get()->getResultArray();