app/Models/ModelRs.php

SELECT *
FROM `tb_rs`
ORDER BY `nm_rs` ASC
---
    public function allData()
    {
        return $this->db->table('tb_rs')
            ->orderBy('nm_rs', 'ASC')
            ->get()->getResultArray();