app/Models/ModelObat.php

SELECT *
FROM `tb_obat`
ORDER BY `tgl_kadaluarsa` ASC
---
    public function allData()
    {
        return $this->db->table('tb_obat')
            ->orderBy('tgl_kadaluarsa', 'ASC')
            ->get()->getResultArray();