app/Models/ModelDokter.php

SELECT *
FROM `tb_dokter`
ORDER BY `nama` ASC
---
    public function allData()
    {
        return $this->db->table('tb_dokter')
            ->orderBy('nama', 'ASC')
            ->get()->getResultArray();