app/Models/ModelPetugas.php

    public function allData()
    {
        return $this->db->table('tb_petugas')
            ->orderBy('nama', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_petugas`
ORDER BY `nama` ASC