app/Models/ModelPasien.php

SELECT *
FROM `tb_pasien`
ORDER BY `nama` ASC
---
    public function allData()
    {
        return $this->db->table('tb_pasien')
            ->orderBy('nama', 'ASC')
            ->get()->getResultArray();