app/Models/ModelAuth.php

    public function login_petugas($username)
    {
        return $this->db->table('tb_petugas')->where([
            'username' => $username,
        ])->get()->getRowArray();
---
SELECT *
FROM `tb_petugas`
WHERE `username` = 'frlakumani_'