app/Models/ModelJadwal.php

SELECT *
FROM `tb_jadwal`
LEFT JOIN `tb_dokter` ON `tb_dokter`.`id_dokter` = `tb_jadwal`.`id_dokter`
ORDER BY `tb_jadwal`.`hari` ASC
---
    public function allData()
    {
        return $this->db->table('tb_jadwal')
            ->join('tb_dokter', 'tb_dokter.id_dokter = tb_jadwal.id_dokter', 'left')
            ->orderBy('tb_jadwal.hari', 'ASC')
            ->get()->getResultArray();