app/Models/ModelLab.php

SELECT *
FROM `tb_lab`
ORDER BY `nm_lab` ASC
---
    public function allData()
    {
        return $this->db->table('tb_lab')
            ->orderBy('nm_lab', 'ASC')
            ->get()->getResultArray();