app/Models/ModelNakes.php

SELECT *
FROM `tb_nakes`
ORDER BY `nama` ASC
---
    public function allData()
    {
        return $this->db->table('tb_nakes')
            ->orderBy('nama', 'ASC')
            ->get()->getResultArray();