app/Models/ModelPoli.php

    public function allData()
    {
        return $this->db->table('tb_poli_rs')
            ->orderBy('nm_poli', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_poli_rs`
ORDER BY `nm_poli` ASC